tested:
```
  # module.cluster-orchestrator.aws_eks_pod_identity_association.controller_role[0] will be created
  + resource "aws_eks_pod_identity_association" "controller_role" {
      + association_arn      = (known after apply)
      + association_id       = (known after apply)
      + cluster_name         = "rssnyder-harness-eks"
      + disable_session_tags = false
      + external_id          = (known after apply)
      + id                   = (known after apply)
      + namespace            = "kube-system"
      + region               = "us-west-2"
      + role_arn             = "arn:aws:iam::664418987337:role/harness-ccm-rssnyder-harness-eks-controller"
      + service_account      = "ccm-cluster-orchestrator-operator"
      + tags_all             = {}
    }

  # module.cluster-orchestrator.aws_iam_role.controller_role will be updated in-place
  ~ resource "aws_iam_role" "controller_role" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "sts:AssumeRoleWithWebIdentity",
                          + "sts:TagSession",
                            "sts:AssumeRole",
                        ]
                      ~ Principal = {
                          - Federated = "arn:aws:iam::664418987337:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/B7C1051F009881287A59DCC702568063"
                          + Service   = "pods.eks.amazonaws.com"
                        }
                        # (1 unchanged attribute hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "harness-ccm-rssnyder-harness-eks-controller"
        name                  = "harness-ccm-rssnyder-harness-eks-controller"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }
```